//Напишите программу, выводящую "Hello, World!". Можно скопировать ее из конспекта.
//
//Sample Input:
//
//Sample Output:
//
//Hello, World!

#include "t00_hello.h"
#include <iostream>

using namespace std;

int main () {
    cout << "Hello, world!";
};
