//Даны три целых числа. Определите, сколько среди них совпадающих. Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).
//
//Формат входных данных
//        Вводятся три числа.
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input:
//
//1
//2
//3
//Sample Output:
//
//0

#ifndef SIMPLE_CPP_PROJECT_T03_EQUAL3_H
#define SIMPLE_CPP_PROJECT_T03_EQUAL3_H


int t03_equal3();


#endif //SIMPLE_CPP_PROJECT_T03_EQUAL3_H
