//Вводится один символ, измените его регистр. То есть, если была введена строчная буква - сделайте ее заглавной и наоборот. Символы, не являющиеся латинской буквой, нужно выводить без изменений.
//
//Входные данные
//
//Вводится единственый символ.
//
//Выходные данные
//
//Выведите ответ на задачу.
//
//Sample Input:
//
//b
//Sample Output:
//
//B

#ifndef IFMO_CPP_PROGRAMMING_20180910_T03_TOGGLE_H
#define IFMO_CPP_PROGRAMMING_20180910_T03_TOGGLE_H


int t03_toggle();


#endif //IFMO_CPP_PROGRAMMING_20180910_T03_TOGGLE_H
