//Определите сумму всех элементов последовательности, завершающейся числом 0.
//
//Формат входных данных
//        Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания.
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input:
//
//3
//6
//8
//0
//Sample Output:
//
//17

#ifndef IFMO_CPP_PROGRAMMING_20180910_T04_SUM_H
#define IFMO_CPP_PROGRAMMING_20180910_T04_SUM_H


int t04_sum();


#endif //IFMO_CPP_PROGRAMMING_20180910_T04_SUM_H
