//Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада через год. Вклад составляет X рублей Y копеек. Определите размер вклада через K лет.
//Формат входных данных
//        Программа получает на вход целые числа P, X, Y, K .
//Формат выходных данных
//        Программа должна вывести два числа: величину вклада через K лет в рублях и копейках. Дробное число копеек по истечение года отбрасывается. Перерасчет суммы вклада (с отбрасыванием дробных частей копеек) происходит ежегодно.
//Примечание
//        В этой задаче часто возникают проблемы с точностью. Если они возникли у вас - попробуйте решить задачу в целых числах.
//Sample Input:
//
//12
//179
//0
//5
//Sample Output:
//
//315 43

#include "t04_deposit.h"
#include <iostream>
#include <cmath>

using namespace std;

int t04_deposit() {
    double p,x,k,s;
    double y;
    cin >> p >> x >> y >> k;
    s=x+0.01*y;
    while (k!=0) {
        s=s+s*(p*0.01);
        y = (s - int(s))*100.0 ;
        if (y-int(y) <= 0.99) y=int (y);
        s=int(s)+y*0.01;
        k--;
    }
    cout << int(s) << ' ' << y;
};