//Процентная ставка по вкладу составляет P процентов годовых, которые прибавляются к сумме вклада через год. Вклад составляет X рублей Y копеек. Определите размер вклада через K лет.
//Формат входных данных
//        Программа получает на вход целые числа P, X, Y, K .
//Формат выходных данных
//        Программа должна вывести два числа: величину вклада через K лет в рублях и копейках. Дробное число копеек по истечение года отбрасывается. Перерасчет суммы вклада (с отбрасыванием дробных частей копеек) происходит ежегодно.
//Примечание
//        В этой задаче часто возникают проблемы с точностью. Если они возникли у вас - попробуйте решить задачу в целых числах.
//Sample Input:
//
//12
//179
//0
//5
//Sample Output:
//
//315 43

#include "t04_deposit.h"
#include <iostream>
#include <cmath>

using namespace std;

int t04_deposit() {
    double percent,X_rub,Y_cent,K_years,B;
    cin>>percent>>X_rub>>Y_cent>>K_years;
    B=X_rub*100+Y_cent;
    while(K_years!=0){
        --K_years;
        B=B*(1+percent/100);
        B=trunc(B);
    }
    cout<<trunc(B/100)<<" "<<(B/100-trunc(B/100))*100;
};


