//Вам дан словарь, состоящий из пар слов. 
// Каждое слово является синонимом к парному ему слову. 
// Все слова в словаре различны. 
// Для одного данного слова определите его синоним.
//
//Входные данные
//
//Программа получает на вход количество пар синонимов N. 
// Далее следует N строк, каждая строка содержит ровно два слова-синонима. 
// После этого следует одно слово.
//
//Выходные данные
//
//Программа должна вывести синоним к данному слову.
//
//Sample Input:
//
//3
//Hello Hi
//Bye Goodbye
//List Array
//Goodbye
//
//Sample Output:
//
//Bye

#include "t05_syn.h"
#include <iostream>
#include <map>

using namespace std;

int t05_syn() {
int N;string s,s1,s2;
cin >> N;
map<string,string>dict;
for(int i=0;i<N;i++){
    cin >> s1 >> s2;
    dict.insert(pair<string,string>(s1,s2));
    dict.insert(pair<string,string>(s2,s1));
}
cin >> s;
cout << dict[s];
}
