//Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов.
//Формат входных данных
//
//        В первой строке вводится количество элементов в массиве. Во второй строке вводятся элементы массива.
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input:
//
//6
//1 2 2 3 3 3
//Sample Output:
//
//3

#include "t06_different.h"
#include <iostream>


using namespace std;

int t06_different() {
int a , b, n , i , d;
d=1;
cin >> n;
cin >> b;
for ( i = 1 ; i < n ; i ++) {
cin >> a;
if ( a != b ) { d = d+1; b=a; } }
cout << d ;

}
