//Последовательность Фибоначчи определяется так:
//
//F(0) = 0, F(1) = 1, …, F(n) = F(n−1) + F(n−2).
//
//По данному числу N определите N-е число Фибоначчи F(N).
//
//Формат входных данных
//        Вводится натуральное число N.
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input:
//
//6
//Sample Output:
//
//8

#include "t08_fibb.h"
#include <iostream>

using namespace std;

int t08_fibb() {
    int fibonacci=0, previous=1, A=0, N;
    cin >> N;
    while (A<N) {
        A += 1;
        previous=fibonacci+previous;
        fibonacci=previous-fibonacci;
    }
    cout << fibonacci;
};