//Дан массив чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.
//Формат входных данных
//
//        В первой строке вводится количество элементов в массиве. Во второй строке вводятся элементы массива.
//Формат выходных данных
//        Выведите ответ на задачу.
//Sample Input 1:
//
//5
//1 2 3 2 3
//Sample Output 1:
//
//2
//Sample Input 2:
//
//5
//1 1 1 1 1
//Sample Output 2:
//
//10

#include "t09_equals.h"
#include <iostream>


using namespace std;

int t09_equals() {
int n, counter;
cin>>n;
int m[n];
for (int z=0; z<n; z++){
    cin>>m[z];
}
counter = 0;
for (int z=0; z<n-1; z++){
    for (int i=z+1; i<n; i++){
        if(m[z]==m[i]) counter++;
    }
}
cout<<counter;
}
